* org-doc web service


** references

- ~suzuki/meta-ruby.git/org/lects/note/sinatra-org/readme.org (self)
  (([[https://github.com/masayuki054/meta-ruby/tree/master/org/note/ruby-note-sinatra-org.org][@github]]/[[file+emacs:~suzuki/meta-ruby.git/org/note/ruby-note-sinatra-org.org][@cis]]/[[file+emacs:~/meta-ruby.git/org/note/ruby-note-sinatra-org.org][@s]]))

- [[http://ops.tokyo/posts/2014/12/12/using-org-babel-for-lp-jp/][OrgBabelで文芸的プログラミング · ops●tokyo]]

Web操作手順書を自動生成！Emacs org-babelで実現するRun Book Automation(RBA) | Futurismo
http://futurismo.biz/archives/2451

- [[http://www.sinatrarb.com/intro-ja.html][Sinatra: README (Japanese)]]

** what

./notes にある .org 文書を表示する Webサービスを作成する。

** how

- rubygems の sinatra，org-convergeを用いる

- readme.org に全てを記述する

** directory
: .
: +-- readme.org 
: |
: +-- org +-- run.org
: |
: +-- src +-- app.rb
: |       +-- Gemfile
: |       +-- config.ru
: |
: +-- notes

#+BEGIN_SRC sh :exports both
mkdir -p org-doc/ org-doc/org org-doc/src org-doc/notes
cp ./ruby-note-sinatra-org.org org-doc/readme.org

#+END_SRC

#+RESULTS:

** sinatraのための設定
*** bundler 

 bundler を gem install

#+BEGIN_SRC sh :exports both :results output
gem install bundler

echo $PATH

#+END_SRC

#+RESULTS:
: /usr/local/bin:/usr/bin:/bin:/usr/sbin:/sbin:/opt/X11/bin:/users/home/masayuki/.rbenv/Darwin.x86_64.14.5.0/bin:/users/home/masayuki/.rbenv/Darwin.x86_64.14.5.0/shims:/users/home/masayuki/local/bin:/users/home/masayuki/.rbenv/Darwin.x86_64.14.5.0/versions/bin:/users/home/masayuki/.rbenv/shims:/users/home/masayuki/.cask/bin:/opt/local/bin:/usr/local/teTeX/bin:/sbin/:/usr/local/sbin:/usr/X11R6/bin:/users/home/masayuki/bin:/users/home/masayuki/depot_tools:/users/home/masayuki/COMM/bin

*** gemfile

 必要な gem を記述

#+BEGIN_SRC ruby :tangle org-doc/src/Gemfile
# src/Gemfile
gem 'sinatra'
gem 'org-converge'
#+END_SRC

*** config.ru

sinatraアプリケーションを起動するための設定
#+BEGIN_SRC ruby :tangle org-doc/src/config.ru
# src/config.ru
require './app.rb'
run Sinatra::Application

#+END_SRC

** service
*** application

sinatra のDSLで，Webサービスを記述:
    
#+BEGIN_SRC ruby :tangle org-doc/src/app.rb 
# src/app.rb
require 'sinatra'

get '/' do
  'OK'
end

get '/org' do
  Dir.glob('../notes/*.org').join("\n")
end

get '/org/*.org' do |doc|
  `(cd ../notes; org2html #{doc}.org)`
  `cat ../notes/#{doc}.html`
end

#+END_SRC

ここでは，org->HTML変換には，~suzuki/COMM/bin/org2html コマンドを利用しています。

代わりに，((% pandoc -f html -t org %))コマンドを使ってもいいですし，
rubygem/org-ruby を使ってもいいかもしれません。

*** 起動

 この文書を，emacs org-mode で C-c C-v C-t して，書き出し，
 下記コマンドでサーバを立ち上げる。

#+BEGIN_SRC sh :directory org-doc
org-converge org/run.org

#+END_SRC

#+RESULTS:

*** 確認

ブラウザで，下記URLにアクセスする:
- 127.0.0.1:9292/, 
- 127.0.0.1:9292/org, 
- 127.0.0.1:9292/org/ORG文書

*** 起動用 org 文書 (org/run.org)
#+BEGIN_SRC org :tangle org-doc/org/run.org
,#+title: running the application
,#+include "org/app.org"

,** run it

,#+name: server
,#+BEGIN_SRC sh :dir src

bundle install
bundle exec rackup

,#+END_SRC

,** access

,#+name: getit
,#+BEGIN_SRC sh :wait 1

  curl 127.0.0.1:9292/ 2>/dev/null
  sleep 2
  curl 127.0.0.1:9292/org  2>/dev/null
  sleep 2
  curl 127.0.0.1:9292/org/ruby-note.org  2>/dev/null
  sleep 2

,#+END_SRC
#+END_SRC
